```
resource "opennebula_virtual_router_instance_template" "test" {
  name        = "testacc-vr-template"
  permissions = "642"
  group       = "oneadmin"
  cpu         = "0.5"
  vcpu        = "1"
  memory      = "512"

  context = {
    dns_hostname = "yes"
    network      = "YES"
  }

  graphics {
    keymap = "en-us"
    listen = "0.0.0.0"
    type   = "VNC"
  }

  os {
    arch = "x86_64"
    boot = ""
  }

  tags = {
    env = "prod"
  }
}

resource "opennebula_virtual_network" "network1" {
  name   = "test-net1"
  type   = "bridge"
  bridge = "onebr"
  mtu    = 1500
  ar {
    ar_type = "IP4"
    size    = 12
    ip4     = "172.16.100.130"
  }
  permissions     = "642"
  group           = "oneadmin"
  security_groups = [0]
  clusters        = [0]
}

resource "opennebula_virtual_router_instance" "test" {
  name        = "testacc-vr-virtual-machine"
  group       = "oneadmin"
  permissions = "642"
  memory      = 128
  cpu         = 0.1

  virtual_router_id = opennebula_virtual_router.test.id
}

resource "opennebula_virtual_router" "test" {
  name        = "testacc-vr"
  permissions = "642"
  group       = "oneadmin"

  instance_template_id = opennebula_virtual_router_instance_template.test.id

  tags = {
    customer = "1"
  }
}

```

Plan:
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # opennebula_virtual_network.network1 will be created
  + resource "opennebula_virtual_network" "network1" {
      + automatic_vlan_id = (known after apply)
      + bridge            = "onebr"
      + clusters          = [
          + 0,
        ]
      + description       = (known after apply)
      + dns               = (known after apply)
      + gateway           = (known after apply)
      + gid               = (known after apply)
      + gname             = (known after apply)
      + group             = "oneadmin"
      + guest_mtu         = 1500
      + hold_size         = (known after apply)
      + id                = (known after apply)
      + ip_hold           = (known after apply)
      + mtu               = 1500
      + name              = "test-net1"
      + network_mask      = (known after apply)
      + permissions       = "642"
      + physical_device   = (known after apply)
      + reservation_size  = (known after apply)
      + reservation_vnet  = (known after apply)
      + security_groups   = [
          + 0,
        ]
      + type              = "bridge"
      + uid               = (known after apply)
      + uname             = (known after apply)
      + vlan_id           = (known after apply)

      + ar {
          + ar_type                = "IP4"
          + computed_global_prefix = (known after apply)
          + computed_ip6           = (known after apply)
          + computed_mac           = (known after apply)
          + computed_ula_prefix    = (known after apply)
          + id                     = (known after apply)
          + ip4                    = "172.16.100.130"
          + size                   = 12
        }
    }

  # opennebula_virtual_router.test will be created
  + resource "opennebula_virtual_router" "test" {
      + gid                  = (known after apply)
      + gname                = (known after apply)
      + group                = "oneadmin"
      + id                   = (known after apply)
      + instance_template_id = (known after apply)
      + name                 = "testacc-vr"
      + permissions          = "642"
      + tags                 = {
          + "customer" = "1"
        }
      + timeout              = 3
      + uid                  = (known after apply)
      + uname                = (known after apply)
    }

  # opennebula_virtual_router_instance.test will be created
  + resource "opennebula_virtual_router_instance" "test" {
      + cpu               = 0.1
      + gid               = (known after apply)
      + gname             = (known after apply)
      + group             = "oneadmin"
      + id                = (known after apply)
      + lcmstate          = (known after apply)
      + memory            = 128
      + name              = "testacc-vr-virtual-machine"
      + on_disk_change    = "swap"
      + pending           = false
      + permissions       = "642"
      + state             = (known after apply)
      + template_disk     = (known after apply)
      + timeout           = 3
      + uid               = (known after apply)
      + uname             = (known after apply)
      + vcpu              = (known after apply)
      + virtual_router_id = (known after apply)

      + vmgroup {
          + role       = (known after apply)
          + vmgroup_id = (known after apply)
        }
    }

  # opennebula_virtual_router_instance_template.test will be created
  + resource "opennebula_virtual_router_instance_template" "test" {
      + context     = {
          + "dns_hostname" = "yes"
          + "network"      = "YES"
        }
      + cpu         = 0.5
      + gid         = (known after apply)
      + gname       = (known after apply)
      + group       = "oneadmin"
      + id          = (known after apply)
      + memory      = 512
      + name        = "testacc-vr-template"
      + permissions = "642"
      + reg_time    = (known after apply)
      + tags        = {
          + "env" = "prod"
        }
      + uid         = (known after apply)
      + uname       = (known after apply)
      + vcpu        = 1

      + graphics {
          + keymap = "en-us"
          + listen = "0.0.0.0"
          + port   = (known after apply)
          + type   = "VNC"
        }

      + os {
          + arch = "x86_64"
        }

      + vmgroup {
          + role       = (known after apply)
          + vmgroup_id = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

opennebula_virtual_router_instance_template.test: Creating...
opennebula_virtual_network.network1: Creating...
opennebula_virtual_router_instance_template.test: Creation complete after 1s [id=1]
opennebula_virtual_router.test: Creating...
opennebula_virtual_router.test: Creation complete after 0s [id=0]
opennebula_virtual_router_instance.test: Creating...
opennebula_virtual_network.network1: Still creating... [10s elapsed]
opennebula_virtual_router_instance.test: Still creating... [10s elapsed]
opennebula_virtual_network.network1: Creation complete after 11s [id=1]
opennebula_virtual_router_instance.test: Creation complete after 13s [id=0]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
```

And destroy:
```
opennebula_virtual_router_instance_template.test: Refreshing state... [id=1]
opennebula_virtual_network.network1: Refreshing state... [id=1]
opennebula_virtual_router.test: Refreshing state... [id=0]
opennebula_virtual_router_instance.test: Refreshing state... [id=0]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # opennebula_virtual_network.network1 will be destroyed
  - resource "opennebula_virtual_network" "network1" {
      - bridge          = "onebr" -> null
      - clusters        = [
          - 0,
        ] -> null
      - gid             = 0 -> null
      - gname           = "oneadmin" -> null
      - group           = "oneadmin" -> null
      - guest_mtu       = 1500 -> null
      - id              = "1" -> null
      - mtu             = 1500 -> null
      - name            = "test-net1" -> null
      - permissions     = "642" -> null
      - security_groups = [
          - 0,
        ] -> null
      - type            = "bridge" -> null
      - uid             = 0 -> null
      - uname           = "oneadmin" -> null

      - ar {
          - ar_type      = "IP4" -> null
          - computed_mac = "02:00:ac:10:64:82" -> null
          - id           = "0" -> null
          - ip4          = "172.16.100.130" -> null
          - size         = 12 -> null
        }
    }

  # opennebula_virtual_router.test will be destroyed
  - resource "opennebula_virtual_router" "test" {
      - gid                  = 0 -> null
      - gname                = "oneadmin" -> null
      - group                = "oneadmin" -> null
      - id                   = "0" -> null
      - instance_template_id = 1 -> null
      - name                 = "testacc-vr" -> null
      - permissions          = "642" -> null
      - tags                 = {
          - "customer" = "1"
        } -> null
      - timeout              = 3 -> null
      - uid                  = 0 -> null
      - uname                = "oneadmin" -> null
    }

  # opennebula_virtual_router_instance.test will be destroyed
  - resource "opennebula_virtual_router_instance" "test" {
      - cpu               = 0.1 -> null
      - gid               = 0 -> null
      - gname             = "oneadmin" -> null
      - group             = "oneadmin" -> null
      - id                = "0" -> null
      - lcmstate          = 3 -> null
      - memory            = 128 -> null
      - name              = "testacc-vr-virtual-machine" -> null
      - on_disk_change    = "swap" -> null
      - pending           = false -> null
      - permissions       = "642" -> null
      - state             = 3 -> null
      - template_disk     = [] -> null
      - timeout           = 3 -> null
      - uid               = 0 -> null
      - uname             = "oneadmin" -> null
      - virtual_router_id = 0 -> null
    }

  # opennebula_virtual_router_instance_template.test will be destroyed
  - resource "opennebula_virtual_router_instance_template" "test" {
      - context     = {
          - "dns_hostname" = "yes"
          - "network"      = "YES"
        } -> null
      - cpu         = 0.5 -> null
      - gid         = 0 -> null
      - gname       = "oneadmin" -> null
      - group       = "oneadmin" -> null
      - id          = "1" -> null
      - memory      = 512 -> null
      - name        = "testacc-vr-template" -> null
      - permissions = "642" -> null
      - reg_time    = 1653294399 -> null
      - tags        = {
          - "env" = "prod"
        } -> null
      - uid         = 0 -> null
      - uname       = "oneadmin" -> null
      - vcpu        = 1 -> null

      - graphics {
          - keymap = "en-us" -> null
          - listen = "0.0.0.0" -> null
          - type   = "VNC" -> null
        }

      - os {
          - arch = "x86_64" -> null
        }
    }

Plan: 0 to add, 0 to change, 4 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

opennebula_virtual_router_instance.test: Destroying... [id=0]
opennebula_virtual_network.network1: Destroying... [id=1]
opennebula_virtual_network.network1: Destruction complete after 0s
opennebula_virtual_router_instance.test: Still destroying... [id=0, 10s elapsed]
opennebula_virtual_router_instance.test: Still destroying... [id=0, 20s elapsed]
opennebula_virtual_router_instance.test: Destruction complete after 20s
opennebula_virtual_router.test: Destroying... [id=0]
opennebula_virtual_router.test: Destruction complete after 0s
opennebula_virtual_router_instance_template.test: Destroying... [id=1]
opennebula_virtual_router_instance_template.test: Destruction complete after 0s

Destroy complete! Resources: 4 destroyed.
```

